#+title: Moonlander and mouse disconnects
#+categories: configuration
#+mermaid: true
#+date: [2024-01-18 Thu]

** linux messages

Luckily the dmesg was filled with logs that highlighted my issue.

#+begin_src shell :results verbatim :dir "/sudo::"
  dmesg -T | grep 'reset full-speed USB device number' | tail -n 10
#+end_src

#+RESULTS:
#+begin_example
[Sun Feb  4 00:39:16 2024] usb 1-1.2.4.4: reset full-speed USB device number 9 using xhci_hcd
[Sun Feb  4 00:39:17 2024] usb 1-1.2.4.1: reset full-speed USB device number 7 using xhci_hcd
[Sun Feb  4 00:39:18 2024] usb 1-1.2.4.4: reset full-speed USB device number 9 using xhci_hcd
[Sun Feb  4 00:39:20 2024] usb 1-1.2.4.4: reset full-speed USB device number 9 using xhci_hcd
[Sun Feb  4 00:39:21 2024] usb 1-1.2.4.1: reset full-speed USB device number 7 using xhci_hcd
[Sun Feb  4 00:39:24 2024] usb 1-1.2.4.1: reset full-speed USB device number 7 using xhci_hcd
[Sun Feb  4 00:39:25 2024] usb 1-1.2.4.4: reset full-speed USB device number 9 using xhci_hcd
[Sun Feb  4 00:39:45 2024] usb 1-1.2.4.4: reset full-speed USB device number 9 using xhci_hcd
[Sun Feb  4 00:39:49 2024] usb 1-1.2.4.4: reset full-speed USB device number 9 using xhci_hcd
[Sun Feb  4 00:39:49 2024] usb 1-1.2.4.4: reset full-speed USB device number 9 using xhci_hcd
#+end_example

The device *7* and *9* are my moonlander and mouse.

#+begin_src shell :results verbatim
  lsusb | grep -e '007' -e '009'
#+end_src

#+RESULTS:
: Bus 001 Device 009: ID 3297:1969 ZSA Technology Labs Moonlander Mark I
: Bus 001 Device 007: ID 046d:c53a Logitech, Inc. PowerPlay Wireless Charging System

This is a sigh of relief as I've finally discovered a lead.


